# Автор: ____________________
# Задание 01: План дня
# Тема 1: Ввод, переменные и вычисления
# Формат: Создать. Уровень: 1.
# Страница пособия: 6.

# Условие
# Выведи ровно четыре строки: «Вторник», «8:30 - Математика», «10:20 - Python», «После уроков -
# отдых». Используй не больше двух вызовов print().


# Переменные
day = "Вторник"
math_lesson = "8:30 - Математика"
python_lesson = "10:20 - Python"
rest = "После уроков - отдых"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# Сверь все четыре строки, пробелы и порядок.
# В коде должно быть не больше двух print().
