# Автор: ____________________
# Задание 05: Не тот оператор
# Тема 1: Ввод, переменные и вычисления
# Формат: Исправить. Уровень: 1.
# Страница пособия: 10.

# Условие
# Программа должна складывать два введённых целых числа. Исправь код и добавь комментарий «# Ошибка:
# ...», объясняющий причину неверного результата.

# Ниже исходный код задания из PDF. Он не является готовым ответом.
# Ошибка: ____________________

# Переменные
a = input("Первое число: ")
b = input("Второе число: ")

# Обработка



# Вывод
print(a + b)

# Проверки из пособия
# Ввод 7 и 5 → 12.
# Ввод -2 и 2 → 0.
