# Автор: ____________________
# Задание 07: Чек на наушники
# Тема 1: Ввод, переменные и вычисления
# Формат: Создать. Уровень: 2.
# Страница пособия: 12.

# Условие
# Запроси название товара, цену > 0 и целое количество >= 1. Выведи три строки: «Товар: ...»,
# «Количество: ...», «Итого: ... евро». Сумму покажи с двумя знаками.


# Переменные
product = "Наушники"
price = 49.90
quantity = 2
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# Наушники, 49.90, 2 → Итого: 99.80 евро.
# Тетрадь, 2.5, 3 → Итого: 7.50 евро.
