# Автор: ____________________
# Задание 09: Длительность фильма
# Тема 1: Ввод, переменные и вычисления
# Формат: Создать. Уровень: 2.
# Страница пособия: 14.

# Условие
# Запроси длительность фильма в целых минутах >= 0. Выведи «Фильм длится H ч M мин», где M от 0 до
# 59. Обычное деление / для часов не используй.


# Переменные
duration_minutes = 135
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 135 → Фильм длится 2 ч 15 мин.
# 59 → 0 ч 59 мин; 60 → 1 ч 0 мин.
