# Автор: ____________________
# Задание 17: Чётное или нечётное
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 1.
# Страница пособия: 23.

# Условие
# Запроси целое число и выведи «чётное» или «нечётное». Программа должна работать также с нулём и
# отрицательными числами.


# Переменные
n = 8
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 8 → чётное; 7 → нечётное.
# 0 и -6 → чётное; -5 → нечётное.
