# Автор: ____________________
# Задание 19: Кино по возрасту
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 1.
# Страница пособия: 25.

# Условие
# В учебной модели билет доступен с 12 лет включительно. Запроси целый возраст >= 0. Если возраст
# меньше 12, выведи «Пока рано», иначе «Можно купить билет». Это правило задачи, а не реальная
# возрастная норма.


# Переменные
age = 11
minimum_age = 12
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 11 → Пока рано; 12 → Можно купить билет.
# 0 → Пока рано; 18 → Можно купить билет.
