# Автор: ____________________
# Задание 21: Шкала оценок
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 2.
# Страница пособия: 27.

# Условие
# Запроси целую оценку. Вне 0..20 выведи «Ошибка». В пределах шкалы: 16..20 - «Отлично», 12..15 -
# «Хорошо», 10..11 - «Зачёт», 0..9 - «Незачёт». Вывод - одна категория.


# Переменные
score = 16
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 16 → Отлично; 15 → Хорошо; 10 → Зачёт; 9 → Незачёт.
# -1 и 21 → Ошибка.
