# Автор: ____________________
# Задание 22: Цена доставки
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 2.
# Страница пособия: 28.

# Условие
# Запроси стоимость заказа >= 0 и город: «центр» или «другой». В центре доставка бесплатна от 50
# евро, иначе 4 евро. В другом городе она всегда 7 евро. Для неизвестного города выведи «Ошибка
# города». Покажи цену доставки с двумя знаками.


# Переменные
order_total = 49.99
city = "центр"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# центр, 49.99 → 4.00; центр, 50 → 0.00.
# другой, 100 → 7.00; север, 60 → Ошибка города.
