# Автор: ____________________
# Задание 25: Калькулятор с защитой
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 2.
# Страница пособия: 31.

# Условие
# Запроси два числа и операцию из +, -, *, /. Выведи результат с двумя знаками. Для деления на ноль
# выведи «Деление на ноль», для иной операции - «Неизвестная операция».


# Переменные
a = 8.0
b = 2.0
operation = "/"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 8, 2, / → 4.00; 3, 4, * → 12.00.
# 5, 0, / → Деление на ноль; 2, 3, ? → Неизвестная операция.
