# Автор: ____________________
# Задание 26: Високосный год
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 3.
# Страница пособия: 32.

# Условие
# Год >= 1 високосный, если делится на 4, кроме кратных 100; кратные 400 всё же високосные. Запроси
# год, составь одно логическое выражение и выведи «Високосный» или «Обычный».


# Переменные
year = 2024
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 2024 и 2000 → Високосный.
# 2026 и 1900 → Обычный.
