# Автор: ____________________
# Задание 28: Скидка и промокод
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 3.
# Страница пособия: 34.

# Условие
# Запроси сумму >= 0 и код. От 100 евро базовая скидка 10%, от 50 - 5%, иначе 0%. Точный код STUDENT
# добавляет 3 процентных пункта. Общая скидка не выше 12%. Выведи процент и итоговую сумму.


# Переменные
amount = 120.0
code = "STUDENT"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 120, STUDENT → 12%; 105.60 евро.
# 60, STUDENT → 8%; 55.20; 40, student → 0%; 40.00.
