# Автор: ____________________
# Задание 30: Тариф за воду
# Тема 2: Условия: if, elif, else
# Формат: Создать. Уровень: 3.
# Страница пособия: 36.

# Условие
# Запроси целый расход воды в м³ >= 0. Первые 10 м³ стоят 1.50 евро каждый, следующие 10 - 2.00,
# весь объём сверх 20 - 3.00. Выведи счёт с двумя знаками. Отрицательный ввод → «Ошибка».


# Переменные
volume = 25
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 0 → 0.00; 10 → 15.00; 11 → 17.00.
# 20 → 35.00; 25 → 50.00; -1 → Ошибка.
