# Автор: ____________________
# Задание 34: Таблица умножения
# Тема 3: Циклы: for и while
# Формат: Создать. Уровень: 1.
# Страница пособия: 41.

# Условие
# Запроси целое число от 1 до 12. Выведи для него таблицу умножения на числа от 1 до 10
# включительно. Формат строки: «7 x 3 = 21».


# Переменные
n = 7
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# Для 7 первая строка 7 x 1 = 7, последняя 7 x 10 = 70.
# Для 1 результаты идут от 1 до 10.
