# Автор: ____________________
# Задание 37: Среднее за неделю
# Тема 3: Циклы: for и while
# Формат: Создать. Уровень: 2.
# Страница пособия: 44.

# Условие
# Запроси количество дней n >= 1. Затем введи n дробных температур, по одной на строку. Выведи
# среднюю температуру с одним знаком после точки. Списки пока не используй.


# Переменные
n = 3
# Для первой проверки введи температуры: 10, 12, 14.
# Списки не используй.
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 3; затем 10, 12, 14 → 12.0.
# 1; затем -5 → -5.0.
