# Автор: ____________________
# Задание 41: Простое ли число?
# Тема 3: Циклы: for и while
# Формат: Создать. Уровень: 3.
# Страница пособия: 48.

# Условие
# Запроси целое n >= 0. Проверь простоту перебором делителей и выведи «Простое» или «Не простое».
# При найденном делителе прекращай поиск. Для 0 и 1 сразу нужен ответ «Не простое».


# Переменные
n = 17
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 2 и 17 → Простое.
# 0, 1, 9 и 21 → Не простое.
