# Автор: ____________________
# Задание 44: Наибольший общий делитель
# Тема 3: Циклы: for и while
# Формат: Создать. Уровень: 3.
# Страница пособия: 51.

# Условие
# Запроси два положительных целых. Найди НОД с помощью while и остатков, без math.gcd(). Для первых
# входных данных запиши в комментарии все пары чисел по шагам. Можно использовать временную
# переменную.


# Переменные
a = 48
b = 18
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 48 и 18 → 6; 17 и 13 → 1.
# 12 и 12 → 12; 1 и 25 → 1.
