# Автор: ____________________
# Задание 49: Маскируем номер
# Тема 4: Строки и обработка текста
# Формат: Создать. Уровень: 1.
# Страница пособия: 57.

# Условие
# Запроси номер из цифр длиной не меньше четырёх. Скрой все символы, кроме последних четырёх,
# звёздочками. Количество звёздочек вычисляй по длине; вывод: «Номер: ...».


# Переменные
number = "4532015112830366"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 4532015112830366 → ************0366.
# 123456789 → *****6789; 1234 → 1234.
