# Автор: ____________________
# Задание 50: Что берёт срез?
# Тема 4: Строки и обработка текста
# Формат: Прочитать. Уровень: 1.
# Страница пособия: 58.

# Условие
# Не запуская код, запиши результат каждой строки print(). Для каждого среза перечисли выбранные
# индексы. Затем проверь прогноз.

# Ниже исходный код задания из PDF. Он не является готовым ответом.
# Сначала запиши прогноз в комментариях, потом запускай исходный код.

# Переменные
word = "PYTHON"

# Обработка



# Вывод
print(word[:2])
print(word[2:5])
print(word[-2:])
print(word[::-1])
print(word[3:3])

# Ответ / прогноз
# ________________________________________
# ________________________________________

# Проверки из пособия
# Ответов должно быть пять, включая пустую строку, если она получается.
# Отдельно объясни действие шага -1.
