# Автор: ____________________
# Задание 51: Палиндром без регистра
# Тема 4: Строки и обработка текста
# Формат: Создать. Уровень: 2.
# Страница пособия: 59.

# Условие
# Запроси непустую фразу из букв и обычных пробелов. Игнорируя регистр и пробелы, проверь, одинаково
# ли она читается в обе стороны. Выведи «Палиндром» или «Не палиндром».


# Переменные
text = "Radar"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# Radar и «А роза упала на лапу Азора» → Палиндром.
# Robot → Не палиндром.
