# Автор: ____________________
# Задание 53: Разбираем учебный e-mail
# Тема 4: Строки и обработка текста
# Формат: Создать. Уровень: 2.
# Страница пособия: 61.

# Условие
# Запроси строку. Допустимый учебный адрес содержит ровно один @, непустые части слева и справа и не
# содержит обычных пробелов. Для него выведи пользователя и домен. Иначе выведи «Некорректный
# адрес». Используй find() и срезы.


# Переменные
email = "tom.lambert@ecole.be"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# tom.lambert@ecole.be → tom.lambert и ecole.be.
# a@@b, @site, name@, a b@c → Некорректный адрес.
