# Автор: ____________________
# Задание 54: Расширение файла
# Тема 4: Строки и обработка текста
# Формат: Создать. Уровень: 2.
# Страница пособия: 62.

# Условие
# Запроси непустое имя без пути. Расширение - часть после последней точки, если точка не первая и не
# последняя. Выведи расширение строчными буквами, иначе «Без расширения».


# Переменные
filename = "photo.JPG"
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# photo.JPG → jpg; archive.tar.gz → gz.
# README, .env, report. → Без расширения.
