# Автор: ____________________
# Задание 64: Вводим оценки
# Тема 5: Списки и наборы данных
# Формат: Создать. Уровень: 1.
# Страница пособия: 73.

# Условие
# Запроси количество оценок n от 0 до 10. Введи n целых оценок от 0 до 20 и сохрани их в списке.
# Затем выведи список в стандартном виде Python и число его элементов.


# Переменные
n = 3
marks = []
# Для первой проверки введи оценки: 12, 15, 9.
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка



# Вывод



# Проверки из пособия
# 3; затем 12, 15, 9 → [12, 15, 9]; количество 3.
# 0 → []; количество 0, без запросов оценок.
