# Автор: ____________________
# Задание 80: Куда пропало число?
# Тема 6: Функции и сборка программ
# Формат: Вопрос. Уровень: 1.
# Страница пособия: 90.

# Условие
# Предскажи вывод. Объясни, почему внешнее number не стало другим. Затем измени только строку вызова
# так, чтобы во внешнее number попал возвращённый результат. global использовать нельзя.

# Ниже исходный код задания из PDF. Он не является готовым ответом.
# Сначала запиши прогноз в комментариях, потом запускай исходный код.

# Переменные
number = 4

# Обработка
def get_number():
    number = 9
    return number
get_number()

# Вывод
print(number)

# Ответ / прогноз
# ________________________________________
# ________________________________________

# Проверки из пособия
# Запиши прогноз для исходного и изменённого вариантов.
# Объясни роль присваивания в строке вызова.
