# Автор: ____________________
# Задание 82: Год как логическая функция
# Тема 6: Функции и сборка программ
# Формат: Создать. Уровень: 2.
# Страница пособия: 92.

# Условие
# Напиши is_leap(year), возвращающую True для високосного года и False для обычного. year >= 1.
# Применяй правило кратности 4, исключения 100 и восстановления 400. Снаружи выведи словесный ответ.


# Переменные
year = 2024
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка
def is_leap(year):
    # Напиши тело функции самостоятельно.
    pass

# Вывод



# Проверки из пособия
# assert is_leap(2024); assert is_leap(2000).
# assert not is_leap(1900); assert not is_leap(2026).
