# Автор: ____________________
# Задание 86: Простота как функция
# Тема 6: Функции и сборка программ
# Формат: Создать. Уровень: 3.
# Страница пособия: 96.

# Условие
# Напиши is_prime(n) для целого n >= 0. Верни bool; 0 и 1 не простые. Проверяй делители только пока
# divisor * divisor <= n. Затем внешним циклом выведи все простые от 2 до 30.


# Переменные
n = 29
upper_limit = 30
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка
def is_prime(n):
    # Напиши тело функции самостоятельно.
    pass

# Вывод



# Проверки из пособия
# is_prime(2) и is_prime(29) → True; is_prime(25) → False.
# В выводе: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29.
