# Автор: ____________________
# Задание 87: Учебный логин
# Тема 6: Функции и сборка программ
# Формат: Создать. Уровень: 3.
# Страница пособия: 97.

# Условие
# Напиши clean_name(text), возвращающую очищенный строчный текст. Напиши make_login(first, last):
# после очистки оба поля должны быть непустыми; тогда верни первую букву имени плюс фамилию. Иначе
# верни None. Входные непустые поля состоят из латинских букв. Внешний код выводит логин или «Нет
# данных».


# Переменные
first = " tOM "
last = " LAMBERT "
# Если условие просит ввод, после первой проверки замени нужные значения на input().

# Обработка
def clean_name(text):
    # Напиши тело функции самостоятельно.
    pass

def make_login(first, last):
    # Напиши тело функции самостоятельно.
    pass

# Вывод



# Проверки из пособия
# " tOM ", " LAMBERT " → tlambert.
# "Anna", "Fox" → afox; имя из пробелов → None.
